uhnp/src/Catalogs/ВидыПодтверждающихДокументовУХ/ВидыПодтверждающихДокументовУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыПодтверждающихДокументовУХ</name>
  <predefined>
    <items>
      <name>ПроизвольныйФайл</name>
      <description>Произвольный файл</description>
    </items>
  </predefined>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектБД</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ВидыПодтверждающихДокументовУХ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПриЧтенииПредставленийНаСервере() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность") Тогда
		МодульМультиязычностьСервер = ОбщегоНазначения.ОбщийМодуль("МультиязычностьСервер");
		МодульМультиязычностьСервер.ПриЧтенииПредставленийНаСервере(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбъектСистемы И НЕ ПрисоединенныйФайл Тогда
		ШаблонОшибки = НСтр("ru = 'Не установлен не один признак хранения файлов'");
		ТекстОшибки  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Поле", "Корректность", НСтр("ru = 'Присоединенный файл'"),,, ШаблонОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "Объект.ПрисоединенныйФайл",, Отказ);
	КонецЕсли;
	
	Если  ОбъектСистемы И НЕ ЗначениеЗаполнено(ОбъектБД) Тогда
		ШаблонОшибки = НСтр("ru = 'Не заполнен реквизит'");
		ТекстОшибки  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Поле", "Корректность", НСтр("ru = 'Объект БД'"),,, ШаблонОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "Объект.ОбъектБД",, Отказ);
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
